app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2020-02-12 05:02:51.672632"], ["updated_at", "2020-02-12 05:02:51.672632"]]
SELECT "books".* FROM "books"
---
	def create
		book = Book.new(book_params)
		if book.save
			redirect_to book_path(book)
			flash[:notice] = "Book was successfully created."
		else
			@book = book
			@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "d"], ["updated_at", "2020-02-12 08:47:21.874280"], ["id", 13]]
---
	def update
		book = Book.find(params[:id])
		if book.update(book_params)